{"characters":[{"title":"Code geass","charactersCOGE":[{"name":"Lelouch vi Britannia","age":"18","birthday":"December 5","gender":"Male","height": "1.78 m","status":"Deceased","description":"Is the protagonist of Code Geass: Lelouch of the Rebellion and Code Geass: Lelouch of the Rebellion R2, and plays a supporting role in sidestories like Code Geass: Oz the Reflection and Code Geass: Lancelot & Guren. After he was exiled he used the alias, Lelouch Lamperouge. He was the Eleventh Prince of the Holy Britannian Empire and the son of the 98th Emperor of Britannia, Charles zi Britannia. He was also the leader of the Black Knights and the real identity of Zero. He is voiced by Jun Fukuyama, while his child self is voiced by Sayaka Ohara. His English dub voice is provided by Johnny Yong Bosch with Michelle Ruff doing Lelouch's child voice.","IMGchar":"https://i.ytimg.com/vi/7PtggAmd5wk/maxresdefault.jpg"},{"name":"C.C.","age":"16","birthday":"Unknown","gender":"Female","height":"1.68 m","status":"Alive","description":"Is the tritagonist of Code Geass: Lelouch of the Rebellion. Her seiyu is Yukana while she is voiced by Kate Higgins in the English dub. C.C. is not her real name; she involuntarily reveals her real name to Lelouch in her sleep, but it is muted so the viewers cannot hear it.","IMGchar": "https://toppng.com/uploads/preview/cc-code-geass-11562990728dk3bcqmufn.png"},{"name":"Suzaku Kururugi","age":"18","birthday":"July 10","gender":"Male","height":"1.76 m","status":"Alive","description":"Is the deuteragonist of the Sunrise anime series Code Geass: Lelouch of the Rebellion, one of the antagonists of Code Geass: Akito the Exiled, and one of the protagonists of Code Geass: Lancelot & Guren. He is voiced by Takahiro Sakurai, while his child self is voiced by Akeno Watanabe. He is voiced by Yuri Lowenthal in the English dub, and his child self is voiced by Laura Bailey. In the 29th Anime Grand Prix, he was placed sixth with 143 votes, then 19th and 13th, respectively, in the following two.","IMGchar":"https://www.pikpng.com/pngl/m/336-3362373_code-geass-suzaku-kururugi-png-png-download-code.png"},{"name":"Cornelia li Britannia","age":"28","birthday":"January 13th","gender":"Female","height":"1.80 m","status":"Alive","description":"Is the second princess of the Britannian Imperial Family and is Lelouch's half-sister. She is extremely skilled in Knightmare Frame combat and completed the establishment of Area 18 shortly before arriving in Area 11. She serves as one of the main antagonists during the first season, but later becomes a neutral character during the second.","IMGchar":"https://vignette.wikia.nocookie.net/codegeass/images/2/24/Cornelia_li_Britannia.jpg/revision/latest/scale-to-width-down/340?cb=20160428174414"},{"name":"Charles zi Britannia","age":"63","birthday":"August 4","gender":"Male","height":"1.97 m","status":"Deceased","description":"He had a Geass power that allowed him to suppress and alter the memories of those he achieved eye contact with, but lost this power in exchange for V.V.'s code which granted him immortality. He served as the main antagonist in both of the series.","IMGchar":"https://i.pinimg.com/736x/fb/47/7d/fb477d62688c7679a290c98aac94254d.jpg"}]},{"title":"Tokyo Ghoul","charactersTOGH":[{"name":"Ken Kaneki","age":"24","birthday":"December 20","gender":"Male","height":"1.70 m","status":"Alive","description":"Is the main protagonist of the Tokyo Ghoul series. He is currently Touka Kirishima's husband, and the father of Ichika Kaneki. Previously, he was a student who studied Japanese literature at Kamii University, living a relatively normal life.","IMGchar":"https://vignette.wikia.nocookie.net/caretubers/images/c/c7/Kaneki%27s_Mask.png/revision/latest?cb=20171110185209&path-prefix=es"},{"name":"Touka Kirishima","age":"27","birthday":"July 1","gender":"Female","height":"1.56 m","status":"Alive","description":"Is a ghoul who is an ex-waitress at Anteiku. She is the daughter of Arata Kirishima and Hikari Kirishima, the older sister of Ayato Kirishima, the wife of Ken Kaneki and the mother of Ichika Kaneki.","IMGchar":"https://toppng.com/uploads/preview/cc-code-geass-11562990728dk3bcqmufn.png"},{"name":"Hideyoshi Nagachika","age":"29","birthday":"June 10","gender":"Male","height":"1.71 m","status":"Alive","description":"Is a young man of average height with short, messy, dirty blonde hair with dark roots and olive eyes. He tends to wear bright colored clothes that consist of a yellow varsity jacket and green shorts. Because of his love for music, he usually wears a pair of headphones around his neck.","IMGchar":"https://www.pikpng.com/pngl/m/336-3362373_code-geass-suzaku-kururugi-png-png-download-code.png"},{"name":"Juuzou Suzuya","age":"29","birthday":"June 8","gender":"Male","height":"1.60 m","status":"Alive","description":"Is a young-looking man with an androgynous appearance, with pale skin and pure shoulder-length white hair. In his hair he wears red hairpins, which form the Roman numeral XIII, keeping back his bangs. He has dark red eyes with bags under them.","IMGchar":"https://vignette.wikia.nocookie.net/codegeass/images/2/24/Cornelia_li_Britannia.jpg/revision/latest/scale-to-width-down/340?cb=20160428174414"},{"name":"Ayato Kirishima","age":"24","birthday":"July 4","gender":"Male","height":"1.59 m","status":"Alive","description":"Was a lean young man, with blue eyes and long, blue messy hair which swept down in front of his eyes. He bore a striking resemblance to his sister and had a rough-looking, rebellious image. He wore a hooded, long-sleeved black leather jacket, and black pants, along with knee-high black boots.","IMGchar":"https://i.pinimg.com/736x/fb/47/7d/fb477d62688c7679a290c98aac94254d.jpg"}]}]}
